tsung-tests/login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="btest.qt8ymkzsu9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
  
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Existing user login" probability="100" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/login" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <request subst="true">  
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser&amp;password=password"/>
      </request>
    </session>
  </sessions>
</tsung>