tsung-tests/signup.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="btest.qt8ymkzsu9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
  
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="New user sign up" probability="100" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/signup" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="10">
        <var name="rnd_user" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="10">
        <var name="rnd_pass" />
      </setdynvars>

      <thinktime random="true" value="2"/>

      <request subst="true">
        <dyn_variable name="created_user_id" re="Location: http://.*/users/(.*)\r"/>
        <http url="/users" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bprofile_pic%5D=https%3A%2F%2Fih0.redbubble.net%2Fimage.425051630.0008%2Fflat%2C750x%2C075%2Cf-pad%2C750x1000%2Cf8f8f8.u3.jpg&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=%%_rnd_pass%%"/>
      </request>

      <request subst="true">
        <http url="/users/%%_created_user_id%%"/>
      </request>
    </session>
 </sessions>
</tsung>